package data;

/**
 * 此类除去计算过程。直接调取Move的方�?
 * @author With You
 */
public class ActionInfo {
	/**
	 * 移动偏移�?
	 */
	public final static int[][] MOVE_OFFSET = { { -1 , 0 },
															  { 1 , 0 },
															  { 0 , -1 },
															  { 0 , 1 },
	
													};
	/**
	 *  占领区域
	 */
	public static enum ATTACK_FIELD{
		
		SPEAR (new int[][][] {
			{ {-1 , 0} , {-2 , 0} , {-3 , 0} , {-4 , 0} },
			{ {1 , 0} , {2 , 0} , {3 , 0} , {4 , 0} },
			{ {0 , -1} , {0 , -2} , {0 , -3} , {0 , -4} },
			{ {0 , 1} , {0 , 2} , {0 , 3} , {0 , 4} },
		}),
		SWORD (new int[][][] {
			{ {-1 , 0} , {-2 , 0} , {0 , 1} , {-1 , 1} , {0 , 2} },
			{ {0 , -1} , {0 , -2} , {1 , 0} , {1 , -1} , {2 , 0} },
			{ {-1 , 0} , {-2 , 0} , {0 , -1} , {-1 , -1} , {0 , -2} },
			{ {0 , 1} , {0 , 2} , {1 , 0} , {1 , 1} , {2 , 0} },
		}),
		BATTLEAX (new int[][][] {
			{ {-1 , -1} , {-1 , 0} , {-1 , 1} , {0 , -1} , {0 , 1} , {1 , -1} , {1 , 1} },
			{ {-1 , 1} , {-1 , 1} , {0 , -1} , {0 , 1} , {1 , -1} , {1 , 0} , {1 , 1} },
			{ {-1 , -1} , {-1 , 0} , {-1 , 1} , {0 , -1} , {1 , -1} , {1 , 0} , {1 , 1} },
			{ {-1 , -1} , {1 , -1} , {-1 , 0} , {1 , 0} , {-1 , 1} , {0 , 1} , {1 , 1} },
		}) ;
		/**
		 *  �?维： 方向
		 *  二维�? X
		 *  三维�? Y
		 */
		public final int[][][] attack_Field;
		
		private ATTACK_FIELD(int [][][] attack_Field){
			this.attack_Field = attack_Field;
		}
		
	}
	
}
